// ── 電文タイプラベル ──

/** 電文タイプの日本語名 */
export function typeLabel(type: string): string {
  const map: Record<string, string> = {
    VXSE51: "震度速報",
    VXSE52: "震源に関する情報",
    VXSE53: "震源・震度に関する情報",
    VXSE56: "地震の活動状況等に関する情報",
    VXSE60: "地震回数に関する情報",
    VXSE61: "顕著な地震の震源要素更新のお知らせ",
    VTSE41: "津波警報・注意報・予報",
    VTSE51: "津波情報",
    VTSE52: "沖合の津波情報",
    VXSE43: "緊急地震速報（警報）",
    VXSE44: "緊急地震速報（予報）",
    VXSE45: "緊急地震速報（地震動予報）",
    VXSE62: "長周期地震動に関する観測情報",
    VZSE40: "地震・津波に関するお知らせ",
    VYSE50: "南海トラフ地震臨時情報",
    VYSE51: "南海トラフ地震関連解説情報（臨時）",
    VYSE52: "南海トラフ地震関連解説情報（定例）",
    VYSE60: "北海道・三陸沖後発地震注意情報",
  };
  return map[type] || type;
}
